app/controllers/posts_controller.rb

    def create
      @post = Post.create(post_params)
---
INSERT INTO "posts" ("caption", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)